# 读取文本格式文件

In [2]:
import pandas as pd
df = pd.read_csv('ex1.csv')

In [3]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
pd.read_table('ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_csv('ex2.csv')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [6]:
pd.read_csv('ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
pd.read_csv('ex2.csv', names = ['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
names = ['a','b','c','d','message']

In [9]:
pd.read_csv('ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [12]:
a=pd.read_csv('csv_mindex.csv',index_col=['key1','key2'])

In [13]:
a

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [26]:
list(open('ex3.csv'))

['A        B        C\n', 'aaaa  -0.2  -1  -0.3\n', 'bbbb -0.4  -23  -345\n']

In [27]:
pd.read_table('ex3.csv',sep='\s+')

        A   B      C
aaaa -0.2  -1   -0.3
bbbb -0.4 -23 -345.0

In [28]:
pd.read_csv('ex3.csv',sep='\s+')

        A   B      C
aaaa -0.2  -1   -0.3
bbbb -0.4 -23 -345.0

In [31]:
pd.read_csv('ex4.csv',skiprows=
           [0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [35]:
a=pd.read_csv('ex5.csv')

In [36]:
pd.isnull(a)

       a      b      c      d  message
0  False  False  False  False    False
1  False  False   True  False    False
2  False  False  False  False    False

In [37]:
senti={'message':['foo'],'something':['two']}

In [38]:
pd.read_csv('ex5.csv',na_values=senti)

   a   b     c   d message
0  1   2   3.0   4   hello
1  5   6   NaN   8   world
2  9  10  11.0  12     NaN

# 逐块读取文本文件

# 将数据写出到文本格式

In [45]:
data = pd.read_csv('ex5.csv')

In [46]:
data

   a   b     c   d message
0  1   2   3.0   4   hello
1  5   6   NaN   8   world
2  9  10  11.0  12     foo

In [48]:
data.to_csv('out.csv')

In [53]:
pd.read_csv('out.csv')

   Unnamed: 0  a   b     c   d message
0           0  1   2   3.0   4   hello
1           1  5   6   NaN   8   world
2           2  9  10  11.0  12     foo

In [58]:
data.to_csv(sys.stdout)

,a,b,c,d,message
0,1,2,3.0,4,hello
1,5,6,,8,world
2,9,10,11.0,12,foo

In [59]:
data.to_csv(sys.stdout,sep='|')

|a|b|c|d|message
0|1|2|3.0|4|hello
1|5|6||8|world
2|9|10|11.0|12|foo

In [60]:
data.to_csv(sys.stdout,na_rep='NULL')

,a,b,c,d,message
0,1,2,3.0,4,hello
1,5,6,NULL,8,world
2,9,10,11.0,12,foo

In [61]:
data.to_csv(sys.stdout,header=False, index=False)

1,2,3.0,4,hello
5,6,,8,world
9,10,11.0,12,foo

In [72]:
data.to_csv(sys.stdout, loc=['a','b'])

TypeError: to_csv() got an unexpected keyword argument 'loc'

In [74]:
dates=pd.date_range('1/1/2000',periods=7)

In [77]:
import numpy as np
ts=pd.Series(np.arange(7),index=dates)

In [90]:
ts.to_csv('tsseries.csv')

In [91]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [95]:
pd.read_csv('tsseries.csv',header=None)

            0  1
0  2000-01-01  0
1  2000-01-02  1
2  2000-01-03  2
3  2000-01-04  3
4  2000-01-05  4
5  2000-01-06  5
6  2000-01-07  6

In [97]:
pd.Series.from_csv('tsseries.csv',parse_dates=True)

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
dtype: int64

In [100]:
import csv

In [101]:
f=open('ex7.csv')

In [102]:
reader = csv.reader(f)

In [103]:
for i in reader:
    print(i)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3', '4']

In [104]:
lines = list(csv.reader(open('ex7.csv')))

In [105]:
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3', '4']]

In [106]:
header, values = lines[0], lines[1:]

In [107]:
data_dict = {h:v for h,v in zip(header,zip(*values))}

In [108]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [116]:
a= zip(values,header)

# JSON

In [118]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 25, "pet": "Zuko"},
{"name": "Katie", "age": 33, "pet": "Cisco"}]
}
"""

In [119]:
import json

In [122]:
result = json.loads(obj)

In [123]:
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 25, 'name': 'Scott', 'pet': 'Zuko'},
  {'age': 33, 'name': 'Katie', 'pet': 'Cisco'}]}

In [125]:
json.dumps(result)

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 25, "pet": "Zuko"}, {"name": "Katie", "age": 33, "pet": "Cisco"}]}'

In [131]:
pd.DataFrame(result['siblings'],columns=['name','age'])

    name  age
0  Scott   25
1  Katie   33

# XML&HTML

In [134]:
import requests
from bs4 import BeautifulSoup

In [135]:
darta = requests.get('http://finance.yahoo.com/q/op?s=AAPL+Options')

In [136]:
soup =BeautifulSoup(darta.text, 'lxml')

In [144]:
soup.find_all('')

[]

# 二进制数据格式